In [1]:
import pandas as pd
import numpy as np

In [20]:
sample_1 = pd.read_excel('C:/Users/namju/Desktop/파이썬 데이터 분석/datasalon/02_개정판/2_Data_Analysis_Basic/files/sample_1.xlsx', 
                         engine = 'openpyxl')

In [18]:
sample_1.head(3)

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241

In [2]:
sample_1 = pd.read_excel('C:/Users/namju/Desktop/파이썬 데이터 분석/datasalon/02_개정판/2_Data_Analysis_Basic/files/sample_1.xlsx',
                        header = 1,
                        skipfooter = 2,
                        usecols = 'A:C',
                        engine = 'openpyxl')

FileNotFoundError: [Errno 2] No such file or directory: 'C:/Users/namju/Desktop/파이썬 데이터 분석/datasalon/02_개정판/2_Data_Analysis_Basic/files/sample_1.xlsx'

In [20]:
sample_1.head(3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [23]:
sample_1.tail(3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [24]:
sample_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [25]:
sample_1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [33]:
sample_1['입국객수']

0    106320
1    191436
2       319
3        42
4    158912
5    232943
Name: 입국객수, dtype: int64

In [34]:
sample_1[['국적코드', '입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [38]:
sample_1['기준년월'] = '2019-11'

In [39]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [42]:
condition = (sample_1['성별'] == '남성')

In [43]:
condition

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [44]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [49]:
condition = (sample_1['성별'] == '남성') & (sample_1['입국객수'] >= 150000)

In [50]:
condition

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [51]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [8]:
condition = (sample_1['성별'] == '남성') & (sample_1['입국객수'] >= 150000)

In [9]:
sample_1[condition]

  국적코드  성별    입국객수
4  A18  남성  158912

In [12]:
condition = (sample_1['국적코드'] == 'A01') \
    | (sample_1['국적코드'] == 'A18')

In [13]:
sample_1[condition]

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
4  A18  남성  158912
5  A18  여성  232943

In [16]:
condition = (sample_1['국적코드'].isin(['A01', 'A18']))

In [19]:
sample_1[condition == False]

  국적코드  성별  입국객수
2  A31  남성   319
3  A31  여성    42

In [22]:
sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [23]:
sample_1['기준년월'] = '2019-11'

In [24]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [27]:
code_master = pd.read_excel('C:/Users/namju/Desktop/파이썬 데이터 분석/datasalon/02_개정판/2_Data_Analysis_Basic/files/sample_codemaster.xlsx', engine = 'openpyxl')

In [28]:
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [30]:
sample_1_code = pd.merge(left = sample_1, right = code_master, how = 'left', left_on = '국적코드', right_on = '국적코드')

In [31]:
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [47]:
sample_1_code = pd.merge(left = sample_1, right = code_master, how = 'left', left_on = '국적코드', right_on = '국적코드')

In [48]:
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [40]:
sample_2 = pd.read_excel('C:/Users/namju/Desktop/파이썬 데이터 분석/datasalon/02_개정판/2_Data_Analysis_Basic/files/sample_2.xlsx',
                        header = 1,
                        skipfooter = 2,
                        usecols = 'A:C',
                        engine = 'openpyxl')

In [41]:
sample_2

  국적코드  성별    입국객수
0  A01  남성   92556
1  A01  여성  163737
2  A18  남성  155540
3  A18  여성  249023

In [42]:
sample_2['기준년월'] = '2019-12'

In [43]:
sample_2

  국적코드  성별    입국객수     기준년월
0  A01  남성   92556  2019-12
1  A01  여성  163737  2019-12
2  A18  남성  155540  2019-12
3  A18  여성  249023  2019-12

In [44]:
sample_2_code = pd.merge(left = sample_2,
                        right = code_master,
                        how = 'left',
                        left_on = '국적코드',
                        right_on = '국적코드')

In [45]:
sample_2_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [49]:
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [50]:
sample = sample_1_code.append(sample_2_code, ignore_index = True)

sample

In [51]:
sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

In [52]:
sample.to_excel('C:/Users/namju/Desktop/파이썬 데이터 분석/데이터 분석 기초/sample.xlsx')

In [53]:
sample.to_excel('C:/Users/namju/Desktop/파이썬 데이터 분석/데이터 분석 기초/non_index_sample.xlsx', index = False)

In [58]:
sample_pivot = sample.pivot_table(values = '입국객수', index = '국적명', columns = '기준년월', aggfunc = 'mean')

In [59]:
sample_pivot

기준년월   2019-11   2019-12
국적명
일본    148878.0  128146.5
중국    195927.5  202281.5

In [5]:
from selenium import webdriver

In [6]:
driver = webdriver.Chrome('C:/Users/namju/Desktop/pyhton_data_alalysis/파이썬 데이터 분석/데이터 분석 기초/chromedriver.exe')

In [7]:
url = 'https://www.naver.com'

In [8]:
driver.get(url)

In [9]:
html = driver.page_source

In [10]:
from bs4 import BeautifulSoup

In [11]:
soup = BeautifulSoup(html, 'html.parser')

In [12]:
tags_span = soup.select('span')

In [13]:
tags_p = soup.select('p')